Autodesk.Revit.DB.FormUtils.CanBeDissolved(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Validates that input contains one or more form elements or geom combinations containing form elements.
ADoc:
The document.
elements:
A collection of elements.
Returns:
True if inputs contain one or more form elements.  Non-form element inputs are ignored.
False if none of the inputs are form elements or do not contain form elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.FormUtils.DissolveForms(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Dissolves a collection of form elements into their defining elements.
ADoc:
The document
elements:
A collection of element IDs of Forms and GeomCombinations that contain Forms that will be dissolved.
Returns:
A collection of curve element ids from the profiles and paths of the dissolved forms.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The elements do not include Forms that can be dissolved.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.FormUtils.DissolveForms(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId}@)
Dissolves a collection of form elements into their defining elements.
Remarks:
Bonding points define the workplane of form profiles and paths and their curves.
The bonding point represents a coordinate system with an origin (reference point) which
can be manipulated to move the curves of a profile together as a unit after dissolve.
Bonding points may themselves be constrained to other parts of the model or parts of the form,
based on how the form was created/constructed.  This is done through the reference point hosting
mechanism.
ADoc:
The document
elements:
A collection of element IDs of Forms and GeomCombinations that contain Forms that will be dissolved.
BondingPointSet:
A collection of the point element ids called "bonding points" (see below for description of "bonding points")
Returns:
A collection of curve element ids from the profiles and paths of the dissolved forms.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The elements do not include Forms that can be dissolved.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.FormUtils
Define Form utility functions